Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Keeps what rows looked like before each save, on this Mac only, for 7 days. It is encrypted, and never synced.
fr: Conserve l'apparence des lignes avant chaque sauvegarde, uniquement sur ce Mac, pendant 7 jours. Il est crypté et ne se synchronise jamais.
ko: 각 저장 이전의 행 상태를 이 Mac에만 7일 동안 보관합니다. 암호화되며 동기화되지 않습니다.
tr: Her kaydetmeden önce satırların nasıl göründüğünü yalnızca bu Mac'te 7 gün saklar. Şifrelenir ve asla eşitlenmez.
vi: Giữ lại trạng thái của các dòng trước mỗi lần lưu, chỉ trên máy Mac này, trong 7 ngày. Dữ liệu được mã hoá và không bao giờ đồng bộ.
zh_hans: 仅在这台 Mac 上保留每次保存之前的行内容，保留 7 天。它是加密的，且从不同步。
zh_hant: 僅在這台 Mac 上保留每次儲存之前的列內容，保留 7 天。它是加密的，且從不同步。

source: A session can call this server's tools only from a connection you tick. It is offered on no others, and a tool it once saw cannot be called by name from one.
fr: Une session ne peut appeler les outils de ce serveur que depuis une connexion que vous cochez. Elle n'est offerte à personne d'autre, et un outil qu'elle a déjà vu ne peut pas être appelé par son nom depuis un autre.

source: %d plugin(s) could not be loaded
fr: %d plugin(s) n'ont pas pu être chargés
ko: %d개 플러그인을 불러올 수 없음
tr: %d eklenti yüklenemedi
vi: Không thể tải %d plugin
zh_hans: %d 个插件无法加载
zh_hant: %d 個外掛無法載入

source: %d rows could not be read back from the source by key. Compare again.
fr: %d lignes n'ont pas pu être lu à nouveau à partir de la source par clé. Comparez à nouveau.

source: Held back
fr: Retardé
ko: 보류됨
tr: Tutuldu
vi: Bị giữ lại
zh_hans: 已保留
zh_hant: 已保留

source: Run button beside each statement
fr: Bouton d'exécution à côté de chaque déclaration
ko: 각 문 옆에 실행 버튼
tr: Her ifadenin yanında çalıştır düğmesi
vi: Nút chạy bên cạnh mỗi câu lệnh
zh_hans: 每条语句旁显示运行按钮
zh_hant: 每個陳述式旁顯示執行按鈕

source: Key
fr: Clé
ko: 키
tr: Anahtar
vi: Khóa
zh_hans: 键
zh_hant: 鍵

source: Search for field...
fr: Rechercher dans le champ...
ko: 필드 검색...
vi: Tìm trường...
zh_hans: 搜索字段...
zh_hant: 搜尋欄位…

source: between
fr: entre
ko: 사이
vi: giữa
zh_hans: 介于
zh_hant: 介於

source: Key Separator
fr: Séparateur de clés
ko: 키 구분자
tr: Anahtar Ayırıcı
vi: Ký tự phân tách khoá
zh_hans: 键分隔符
zh_hant: 鍵分隔符號

source: Statement %1$d/%2$d failed: %3$@
fr: Affirmation %1$d/%2$d échouée : %3$@
ko: %2$d개 중 %1$d번째 문 실패: %3$@
tr: %1$d/%2$d numaralı ifade başarısız oldu: %3$@
vi: Câu lệnh %1$d/%2$d thất bại: %3$@
zh_hans: 第 %1$d/%2$d 条语句失败：%3$@
zh_hant: 第 %1$d/%2$d 條陳述式失敗：%3$@

source: Loading…
fr: Chargement en cours...
ko: 불러오는 중…
tr: Yükleniyor…
vi: Đang tải…
zh_hans: 正在加载…
zh_hant: 正在載入…

source: Create %1$@ %2$@
fr: Créer %1$@ %2$@
ko: %1$@ %2$@ 생성
tr: %1$@ %2$@ oluştur
vi: Tạo %1$@ %2$@
zh_hans: 创建 %1$@ %2$@
zh_hant: 建立 %1$@ %2$@

source: output_path must end in .%@ for this format.
fr: Le chemin de sortie doit se terminer par .%@ pour ce format.
ko: 이 형식에서는 output_path가 .%@(으)로 끝나야 합니다.
tr: Bu biçim için output_path .%@ ile bitmelidir.
vi: Với định dạng này, output_path phải kết thúc bằng .%@.
zh_hans: 对于此格式，output_path 必须以 .%@ 结尾。
zh_hant: 對於此格式，output_path 必須以 .%@ 結尾。

source: Failed: %@
fr: Échec : %@
ko: 실패: %@
tr: Başarısız: %@
vi: Thất bại: %@
zh_hans: 失败：%@
zh_hant: 失敗：%@

source: Clear Results
fr: Résultats clairs
ko: 결과 지우기
tr: Sonuçları Temizle
vi: Xóa kết quả
zh_hans: 清除结果
zh_hant: 清除結果

source: Connection Mode
fr: Mode de connexion
ko: 연결 모드
tr: Bağlantı Modu
vi: Chế độ kết nối
zh_hans: 连接模式
zh_hant: 連線模式

source: AWS Profile
fr: Profil AWS

source: Team Library
fr: Bibliothèque d'équipe
ko: 팀 라이브러리
tr: Takım Kitaplığı
vi: Thư viện nhóm
zh_hans: 团队库
zh_hant: 團隊庫

source: Value is required
fr: La valeur est requise
ko: 값이 필요합니다
tr: Değer gereklidir
vi: Giá trị là bắt buộc
zh_hans: 值为必填项
zh_hant: 值為必填

source: Drop %1$@ %2$@
fr: Déposer %1$@ %2$@
ko: %1$@ %2$@ 삭제
tr: %1$@ %2$@ sil
vi: Xóa %1$@ %2$@
zh_hans: 删除 %1$@ %2$@
zh_hant: 刪除 %1$@ %2$@

source: Maximum tabs to return (1-500, default 20)
fr: Nombre maximum de onglets à retourner (1-500, par défaut 20)
ko: 반환할 최대 탭 수(1~500, 기본값 20)
tr: Döndürülecek en fazla sekme (1-500, varsayılan 20)
vi: Số tab tối đa trả về (1-500, mặc định 20)
zh_hans: 最多返回多少标签页（1-500，默认 20）
zh_hant: 最多回傳多少標籤頁（1-500，預設 20）

source: Run All Statements
fr: Exécuter toutes les déclarations

source: Full-width semicolon (U+FF1B). SQL reads only ; as a statement separator.
fr: Point-virgule de largeur complète (U+FF1B). SQL ne lit que ; comme séparateur d'instruction.
ko: 전각 세미콜론(U+FF1B). SQL은 ;만 문장 구분자로 인식합니다.
tr: Tam genişlikte noktalı virgül (U+FF1B). SQL yalnızca ; karakterini deyim ayırıcı olarak okur.
vi: Dấu chấm phẩy toàn độ rộng (U+FF1B). SQL chỉ đọc ; là dấu phân tách câu lệnh.
zh_hans: 全角分号（U+FF1B）。SQL 只把 ; 当作语句分隔符。
zh_hant: 全形分號（U+FF1B）。SQL 只把 ; 當作陳述式分隔符號。

source: true
fr: vrai

source: Search %@
fr: Rechercher %@
ko: %@ 검색
tr: %@ ara
vi: Tìm %@
zh_hans: 搜索 %@
zh_hant: 搜尋 %@

source: Focus Tab
fr: Fichier de mise au point
ko: 탭으로 이동
tr: Sekmeye Odaklan
vi: Chuyển tới tab
zh_hans: 聚焦标签页
zh_hant: 聚焦標籤頁

source: Name as supplied
fr: Nom tel qu'indiqué
ko: 입력한 그대로의 이름
tr: Verildiği haliyle ad
vi: Tên đúng như được cung cấp
zh_hans: 按提供时的原样名称
zh_hant: 按提供時的原樣名稱

source: The address has to be HTTPS unless the server runs on this Mac. The token is kept in your Keychain and never synced.
fr: L'adresse doit être HTTPS à moins que le serveur ne fonctionne sur ce Mac. Le jeton est stocké dans votre portefeuille de clés et n'est jamais synchronisé.

source: Updated
fr: Mis à jour
ko: 업데이트됨
vi: Đã cập nhật
zh_hans: 已更新
zh_hant: 已更新

source: Import data
fr: Importer des données
ko: 데이터 가져오기
vi: Nhập dữ liệu
zh_hans: 导入数据
zh_hant: 匯入資料

source: Dark
fr: Sombre
ko: 다크
tr: Koyu
vi: Tối
zh_hans: 深色
zh_hant: 深色

source: Total Size
fr: Taille totale
ko: 전체 크기
tr: Toplam Boyut
vi: Tổng kích thước
zh_hans: 总大小
zh_hant: 總大小

source: Cursor style:
fr: Style du curseur :
ko: 커서 스타일:
tr: İmleç stili:
vi: Kiểu con trỏ:
zh_hans: 光标样式：
zh_hant: 游標樣式：

source: Execute All
fr: Exécuter tout
ko: 모두 실행
tr: Tümünü Çalıştır
vi: Thực thi tất cả
zh_hans: 全部执行
zh_hant: 全部執行

source: Sync Paused
fr: Synchronisation suspendue
ko: 동기화 일시 중지됨
tr: Eşitleme Duraklatıldı
vi: Đồng bộ đã tạm dừng
zh_hans: 同步已暂停
zh_hant: 同步已暫停

source: Database name
fr: Nom de la base de données
ko: 데이터베이스 이름
tr: Veritabanı adı
vi: Tên cơ sở dữ liệu
zh_hans: 数据库名称
zh_hant: 資料庫名稱

source: Reject
fr: Rejeter

source: Query History
fr: Historique des requêtes
ko: 쿼리 기록
tr: Sorgu Geçmişi
vi: Lịch sử truy vấn
zh_hans: 查询历史
zh_hant: 查詢歷史

source: Describe Create Database Options
fr: Décrire les options de création de base de données
ko: 데이터베이스 생성 옵션 설명
tr: Veritabanı Oluşturma Seçeneklerini Açıkla
vi: Mô tả tuỳ chọn tạo cơ sở dữ liệu
zh_hans: 说明创建数据库的选项
zh_hant: 說明建立資料庫的選項

source: Apply and Rebuild
fr: Appliquer et reconstruire

source: Copy Table Name
fr: Copier le nom de la table
ko: 테이블 이름 복사
tr: Tablo Adını Kopyala
vi: Sao chép tên bảng
zh_hans: 复制表名
zh_hant: 複製資料表名稱

source: Range
fr: Gamme
ko: 범위
tr: Aralık
vi: Khoảng
zh_hans: 范围
zh_hant: 範圍

source: Sign in with GitHub
fr: Se connecter avec GitHub
ko: GitHub로 로그인
tr: GitHub ile Oturum Aç
vi: Đăng nhập bằng GitHub
zh_hans: 使用 GitHub 登录
zh_hant: 使用 GitHub 登入

source: Choose a source and a target, then compare them.
fr: Choisissez une source et une cible, puis comparez-les.
ko: 원본과 대상을 선택한 다음 비교하십시오.
tr: Bir kaynak ve bir hedef seçin, sonra karşılaştırın.
vi: Chọn nguồn và đích, rồi so sánh chúng.
zh_hans: 选择来源和目标，然后比较它们。
zh_hant: 選擇來源和目標，然後比較它們。

source: %@ matches
fr: %@ correspondances

source: Latency: %dms
fr: Latence : %dms
ko: 지연 시간: %dms
tr: Gecikme: %dms
vi: Độ trễ: %dms
zh_hans: 延迟：%dms
zh_hant: 延遲:%dms

source: Statement:
fr: Déclaration :
ko: SQL 문:
vi: Câu lệnh:
zh_hans: 语句：
zh_hant: 陳述式：

source: Back Up %lld Databases…
fr: Sauvegarde des bases de données %lld...

source: Remove provider
fr: Supprimer le fournisseur
ko: 제공자 제거
tr: Sağlayıcıyı kaldır
vi: Xóa nhà cung cấp
zh_hans: 移除提供商
zh_hant: 移除供應商

source: Import from URL
fr: Importer depuis l'URL
ko: URL에서 가져오기
tr: URL'den İçe Aktar
vi: Nhập từ URL
zh_hans: 从 URL 导入
zh_hant: 從 URL 匯入

source: The server's answer could not be read.
fr: La réponse du serveur n'a pas pu être lu.

source: Confirm Writes
fr: Confirmer les écrits
ko: 쓰기 확인
tr: Yazmaları Onayla
vi: Xác nhận ghi
zh_hans: 确认写入
zh_hant: 確認寫入

source: Are you sure you want to delete "%@"? Saved queries linked to this connection will also be deleted.
fr: Êtes-vous sûr de vouloir supprimer "%@" ? Les requêtes enregistrées liées à cette connexion seront également supprimées.
ko: "%@"을(를) 삭제하시겠습니까? 이 연결에 링크된 저장된 쿼리도 삭제됩니다.
tr: "%@" öğesini silmek istediğinizden emin misiniz? Bu bağlantıya bağlı kayıtlı sorgular da silinecek.
vi: Bạn có chắc muốn xóa "%@"? Các truy vấn đã lưu liên kết với kết nối này cũng sẽ bị xóa.
zh_hans: 确定要删除“%@”吗？与此连接关联的已保存查询也将被删除。
zh_hant: 確定要刪除「%@」嗎？與此連線關聯的已儲存查詢也會一併刪除。

source: This query may permanently modify or delete data.
fr: Cette requête peut modifier ou supprimer définitivement les données.
ko: 이 쿼리는 데이터를 영구적으로 변경하거나 삭제할 수 있습니다.
vi: Truy vấn này có thể sửa đổi hoặc xóa dữ liệu vĩnh viễn.
zh_hans: 此查询可能会永久修改或删除数据。
zh_hant: 此查詢可能會永久修改或刪除資料。

source: Image Viewer
fr: Visualiseur d'images

source: Whether row counts were fetched
fr: Que les comptages de lignes ont été récupérés ou non
ko: 행 수를 가져왔는지 여부
tr: Satır sayılarının alınıp alınmadığı
vi: Có lấy số dòng hay không
zh_hans: 是否获取了行数
zh_hant: 是否取得了列數

source: %d rows match. Matching rows are counted, not listed, so a difference is never crowded out of this list.
fr: %d correspondances de lignes. Les lignes correspondantes sont comptées, et non listées, de sorte qu'une différence n'est jamais écrasée de cette liste.
ko: %d개 행이 일치합니다. 일치하는 행은 목록에 넣지 않고 개수만 세므로, 차이점이 목록에서 밀려나지 않습니다.
tr: %d satır eşleşiyor. Eşleşen satırlar listelenmez, sayılır; böylece bir fark bu listeden dışarı itilmez.
vi: %d dòng khớp nhau. Các dòng khớp chỉ được đếm chứ không liệt kê, nên khác biệt không bao giờ bị đẩy khỏi danh sách này.
zh_hans: %d 行相同。相同的行只计数不列出，因此差异不会被挤出此列表。
zh_hant: %d 列相同。相同的列只計數不列出，因此差異不會被擠出此清單。

source: Open Database (⌘K)
fr: Ouvrir la base de données (⌘K)
ko: 데이터베이스 열기(⌘K)
vi: Mở cơ sở dữ liệu (⌘K)
zh_hans: 打开数据库 (⌘K)
zh_hant: 開啟資料庫 (⌘K)

source: Row count the engine reports
fr: Compter la ligne des rapports du moteur
ko: 엔진이 보고한 행 수
tr: Motorun bildirdiği satır sayısı
vi: Số dòng do engine báo cáo
zh_hans: 引擎报告的行数
zh_hant: 引擎回報的列數

source: number sign
fr: Signe de numéro
ko: 샵 기호
tr: diyez işareti
vi: dấu thăng
zh_hans: 井号
zh_hant: 井字號

source: Host scope, where the engine has one
fr: Portée de l'hôte, où le moteur en a un
ko: 엔진에 호스트 범위가 있는 경우의 호스트 범위
tr: Motorda varsa ana makine kapsamı
vi: Phạm vi host, khi engine có nó
zh_hans: 主机作用域，前提是引擎有这个概念
zh_hant: 主機範圍，前提是引擎有這個概念

source: No Databases
fr: Pas de bases de données
ko: 데이터베이스 없음
tr: Veritabanı Yok
vi: Không có cơ sở dữ liệu
zh_hans: 没有数据库
zh_hant: 沒有資料庫

source: Schema whose columns were searched, when they were
fr: Schéma dont les colonnes ont été recherchées, quand elles l'ont été.

# Token '%@' with permission '%@' cannot access '%@'
source: Token '%1$@' with permission '%2$@' cannot access '%3$@'
fr: Le jeton '%1$@' avec la permission '%2$@' ne peut pas accéder à '%3$@'
ko: 권한 '%2$@'이(가) 있는 토큰 '%1$@'은(는) '%3$@'에 접근할 수 없습니다
tr: '%@' izinli '%@' token'ı '%@' kaynağına erişemiyor
vi: Token '%@' với quyền '%@' không thể truy cập '%@'
zh_hans: 权限为 '%@' 的令牌 '%@' 无法访问 '%@'
zh_hant: 權限為 '%1$@' 的權杖 '%2$@' 無法存取 '%3$@'

source: Open Session
fr: Session ouverte

source: Rows the engine reported inserting
fr: Les lignes du moteur ont signalé l'insertion
ko: 엔진이 삽입했다고 보고한 행
tr: Motorun eklediğini bildirdiği satırlar
vi: Số dòng mà engine báo cáo đã chèn
zh_hans: 引擎报告已插入的行
zh_hant: 引擎回報已插入的列

source: This engine does not take a secondary index in a CREATE TABLE.
fr: Ce moteur ne prend pas d'indice secondaire dans une CRÉATION DE TABLE.

source: Waiting for %@
fr: En attendant %@

source: Position in the parent's declared order
fr: Position dans l'ordre déclaré des parents

source: Queries recently run against a connection, newest first. limit is 1 to 500 and defaults to 50, search matches the query text, and date_filter is today, thisWeek or thisMonth.
fr: Les requêtes exécutées récemment contre une connexion, de la plus récente à la plus ancienne. La limite est de 1 à 500 et par défaut est de 50, la recherche correspond au texte de la requête, et date_filter est aujourd'hui, cette semaine ou ce mois.
ko: 연결에서 최근에 실행한 쿼리를 최신순으로 반환합니다. limit은 1에서 500까지이고 기본값은 50이며, search는 쿼리 텍스트와 일치시키고, date_filter는 today, thisWeek 또는 thisMonth입니다.
tr: Bir bağlantıda son çalıştırılan sorgular, en yeniden başlayarak. limit 1 ile 500 arasındadır ve varsayılanı 50'dir, search sorgu metniyle eşleşir ve date_filter today, thisWeek ya da thisMonth olur.
vi: Các truy vấn chạy gần đây trên một kết nối, mới nhất trước. limit từ 1 đến 500 và mặc định là 50, search khớp với nội dung truy vấn, còn date_filter là today, thisWeek hoặc thisMonth.
zh_hans: 某个连接上最近运行的查询，最新的在前。limit 取值 1 到 500，默认 50；search 匹配查询文本；date_filter 取 today、thisWeek 或 thisMonth。
zh_hant: 某個連線上最近執行的查詢，最新的在前。limit 取值 1 到 500，預設 50；search 比對查詢文字；date_filter 取 today、thisWeek 或 thisMonth。

source: %1$d of %2$d tables will be compared.
fr: %1$d de %2$d tables seront comparées.
ko: %2$d개 테이블 중 %1$d개를 비교합니다.
tr: %2$d tablodan %1$d tanesi karşılaştırılacak.
vi: %1$d trên %2$d bảng sẽ được so sánh.
zh_hans: 将比较 %2$d 个表中的 %1$d 个。
zh_hant: 將比較 %2$d 個資料表中的 %1$d 個。

source: Load in Editor
fr: Charger dans l'éditeur
ko: 편집기에서 불러오기
tr: Düzenleyiciye Yükle
vi: Tải vào trình soạn thảo
zh_hans: 在编辑器中加载
zh_hant: 在編輯器中載入

source: Entry id
fr: Identifiant d'entrée
ko: 항목 id
tr: Girdi kimliği
vi: Id mục
zh_hans: 条目 id
zh_hant: 項目 id

source: Preferred tries TLS first, falls back to plain. Matches psql and DataGrip defaults. Required by AWS RDS, Cloud SQL, Heroku, Supabase, Neon.
fr: Le premier essai préféré est TLS, puis il passe au mode simple. Correspond aux paramètres par défaut de psql et DataGrip. Nécessaire pour AWS RDS, Cloud SQL, Heroku, Supabase, Neon.
ko: 선호는 먼저 TLS를 시도하고 평문 연결로 전환합니다. psql 및 DataGrip 기본값과 같습니다. AWS RDS, Cloud SQL, Heroku, Supabase 및 Neon에는 필수를 사용해야 합니다.
tr: Tercih Edilen önce TLS dener, olmazsa düz bağlantıya döner. psql ve DataGrip varsayılanlarıyla aynıdır. AWS RDS, Cloud SQL, Heroku, Supabase ve Neon için Zorunlu gerekir.
vi: Preferred thử TLS trước, chuyển sang kết nối thường nếu thất bại. Giống mặc định của psql và DataGrip. AWS RDS, Cloud SQL, Heroku, Supabase, Neon yêu cầu Required.
zh_hans: “首选”先尝试 TLS，失败后回退到明文，与 psql 和 DataGrip 的默认行为一致。AWS RDS、Cloud SQL、Heroku、Supabase、Neon 要求使用“必需”。
zh_hant: 「Preferred」會先嘗試 TLS，失敗後改用純文字連線，與 psql 和 DataGrip 的預設行為一致。AWS RDS、Cloud SQL、Heroku、Supabase、Neon 要求使用「Required」。

source: Focus Editor
fr: Éditeur de Focus

source: Database Type:
fr: Type de base de données :
ko: 데이터베이스 유형:
tr: Veritabanı Türü:
vi: Loại cơ sở dữ liệu:
zh_hans: 数据库类型:
zh_hant: 資料庫類型：

source: %1$@ was not found on this system. %2$@
fr: %1$@ n'a pas été trouvé sur ce système. %2$@

source: Node count
fr: Nombre de nœuds
ko: 노드 수
tr: Düğüm sayısı
vi: Số nút
zh_hans: 节点数
zh_hant: 節點數

source: Microsoft Entra ID Sign-In Required
fr: Connexion requise avec Microsoft Entra ID.
ko: Microsoft Entra ID 로그인 필요
tr: Microsoft Entra ID ile oturum açma gerekli
vi: Yêu cầu đăng nhập Microsoft Entra ID
zh_hans: 需要 Microsoft Entra ID 登录
zh_hant: 需要 Microsoft Entra ID 登入

source: Production reader
fr: Lecteur de production

source: System Tables
fr: Tables système
ko: 시스템 테이블
tr: Sistem Tabloları
vi: Bảng hệ thống
zh_hans: 系统表
zh_hant: 系統資料表

source: %@ cannot edit a table's structure.
fr: %@ ne peut pas modifier la structure d’un tableau.

source: Read Only
fr: En lecture seule
ko: 읽기 전용
tr: Salt Okunur
vi: Chỉ đọc
zh_hans: 只读
zh_hant: 唯讀

source: OAuth Token
fr: Token OAuth
ko: OAuth 토큰
tr: OAuth Belirteci
vi: Token OAuth
zh_hans: OAuth 令牌
zh_hant: OAuth 權杖

source: Drop database '%@'?
fr: Supprimer la base de données '%@' ?
ko: 데이터베이스 '%@'을(를) 삭제하시겠습니까?
tr: '%@' veritabanı silinsin mi?
vi: Xoá cơ sở dữ liệu '%@'?
zh_hans: 删除数据库 '%@'？
zh_hant: 要刪除資料庫「%@」嗎？

source: Clear History…
fr: Effacer l'historique...
ko: 기록 지우기…
tr: Geçmişi Temizle…
vi: Xóa lịch sử…
zh_hans: 清除历史…
zh_hant: 清除歷程記錄…

source: %d deleted
fr: %d supprimé
ko: %d개 삭제됨
tr: %d silindi
vi: %d đã xoá
zh_hans: 已删除 %d 个
zh_hant: 已刪除 %d 個

source: This plan is too large to save.
fr: Ce plan est trop grand pour être sauvegardé.
ko: 이 플랜은 너무 커서 저장할 수 없습니다.
tr: Bu plan kaydedilemeyecek kadar büyük.
vi: Kế hoạch này quá lớn để lưu.
zh_hans: 此计划过大，无法保存。
zh_hant: 此計劃過大，無法儲存。

source: Copy Visible
fr: Copie visible

source: Drag to reorder this filter
fr: Faites glisser pour réorganiser ce filtre.
ko: 드래그하여 이 필터의 순서 변경
tr: Bu filtreyi yeniden sıralamak için sürükleyin
vi: Kéo để sắp xếp lại bộ lọc này
zh_hans: 拖动以重新排列此筛选条件
zh_hant: 拖曳以重新排列這個篩選條件

source: '%@' is not a process id on this engine. Take one from get_server_dashboard.
fr: '%@' n'est pas un identifiant de processus sur ce moteur. Prenez-en un depuis get_server_dashboard.

source: New…
fr: Nouveau...

source: Network is unavailable. Changes will sync when connectivity is restored.
fr: Le réseau n'est pas disponible. Les modifications seront synchronisées lorsque la connectivité sera rétablie.
ko: 네트워크를 사용할 수 없습니다. 연결이 복원되면 변경 사항이 동기화됩니다.
tr: Ağ kullanılamıyor. Bağlantı sağlandığında değişiklikler eşitlenecek.
vi: Mạng không khả dụng. Các thay đổi sẽ được đồng bộ khi có kết nối trở lại.
zh_hans: 网络不可用。恢复连接后将自动同步更改。
zh_hant: 網路無法使用。連線恢復後將自動同步變更。

source: Edit Values…
fr: Modifier les valeurs...
ko: 값 편집…
tr: Değerleri Düzenle…
vi: Chỉnh sửa giá trị…
zh_hans: 编辑值…
zh_hant: 編輯值…

source: %@ slower than the baseline
fr: %@ plus lent que la ligne de base
ko: 기준보다 %@ 느림
tr: temel plandan %@ daha yavaş
vi: Chậm hơn %@ so với bản gốc
zh_hans: 比基准慢 %@
zh_hant: 比基準慢 %@

source: That maintenance operation is not available on this connection.
fr: Cette opération de maintenance n'est pas disponible sur cette connexion.
ko: 이 연결에서는 해당 유지 관리 작업을 사용할 수 없습니다.
tr: Bu bakım işlemi bu bağlantıda kullanılamıyor.
vi: Thao tác bảo trì đó không dùng được trên kết nối này.
zh_hans: 该维护操作在此连接上不可用。
zh_hant: 該維護作業在此連線上無法使用。

source: History: %@
fr: Histoire : %@

source: Connection display name
fr: Nom d'affichage de la connexion
ko: 연결 표시 이름
tr: Bağlantı görünen adı
vi: Tên hiển thị của kết nối
zh_hans: 连接的显示名称
zh_hant: 連線的顯示名稱

source: Value the operator compares against
fr: Valeur que l'opérateur compare avec
ko: 연산자가 비교 대상으로 삼는 값
tr: Operatörün karşılaştırdığı değer
vi: Giá trị mà toán tử so sánh với
zh_hans: 运算符所比较的值
zh_hant: 運算子所比較的值

source: Pin Result
fr: Résultat de la fixation
ko: 결과 고정
tr: Sonucu Sabitle
vi: Ghim kết quả
zh_hans: 固定结果
zh_hant: 釘選結果

source: List Triggers
fr: Liste des déclencheurs
ko: 트리거 목록
tr: Tetikleyicileri Listele
vi: Liệt kê trigger
zh_hans: 列出触发器
zh_hant: 列出觸發器

source: less than
fr: Moins que
ko: 보다 작음
tr: küçüktür
vi: nhỏ hơn
zh_hans: 小于
zh_hant: 小於

source: %@ accepts null
fr: %@ accepte null

source: Matching tables and views first, those in the current schema leading, then matching columns
fr: Correspondance des tables et des vues en premier, celles du schéma actuel en tête, puis correspondance des colonnes.

source: The target driver cannot run a sync script.
fr: Le pilote cible ne peut pas exécuter un script de synchronisation.
ko: 대상 드라이버는 동기화 스크립트를 실행할 수 없습니다.
tr: Hedef sürücü eşitleme betiği çalıştıramıyor.
vi: Driver đích không thể chạy script đồng bộ.
zh_hans: 目标驱动无法运行同步脚本。
zh_hant: 目標驅動程式無法執行同步指令稿。

# Data quality audit for %@ on %@
source: Data quality audit for %1$@ on %2$@
fr: Audit de la qualité des données pour %1$@ sur %2$@
ko: %2$@의 %1$@에 대한 데이터 품질 감사
tr: %2$@ üzerindeki %1$@ için veri kalitesi denetimi
vi: Kiểm định chất lượng dữ liệu cho %1$@ trên %2$@
zh_hans: 对 %2$@ 上 %1$@ 的数据质量审计
zh_hant: 對 %2$@ 上 %1$@ 的資料品質稽核

source: Transfer completed
fr: Transfert terminé

source: Plugins signed by this developer stop loading the next time TablePro starts.
fr: Les plugins signés par ce développeur arrêtent de se charger la prochaine fois que TablePro démarre.
ko: 이 개발자가 서명한 플러그인은 다음에 TablePro를 시작할 때부터 로드되지 않습니다.
tr: Bu geliştiricinin imzaladığı eklentiler, TablePro'nun bir sonraki açılışında yüklenmeyi bırakır.
vi: Các plugin do nhà phát triển này ký sẽ ngừng được tải trong lần khởi động TablePro tiếp theo.
zh_hans: 此开发者签名的插件将在下次启动 TablePro 时停止加载。
zh_hant: 此開發者簽署的外掛將在下次啟動 TablePro 時停止載入。

source: Table that was counted
fr: Table qui a été comptée
ko: 행 수를 센 테이블
tr: Sayılan tablo
vi: Bảng đã được đếm
zh_hans: 被统计的表
zh_hant: 被統計的資料表

source: Save SQL file
fr: Sauvegarder le fichier SQL
ko: SQL 파일 저장
tr: SQL dosyasını kaydet
vi: Lưu tệp SQL
zh_hans: 保存 SQL 文件
zh_hant: 儲存 SQL 檔案

source: What a session proposes and runs appears here
fr: Ce que propose et exécute une session apparaît ici.

source: A gs:// prefix. BigQuery shards its output, so several files are written under it.
fr: Un préfixe gs://. BigQuery divise ses résultats en morceaux, de sorte que plusieurs fichiers sont écrits sous celui-ci.

source: Switch to this schema before executing
fr: Changez de schéma avant d'exécuter.
ko: 실행 전에 이 스키마로 전환
tr: Yürütmeden önce bu şemaya geç
vi: Chuyển sang schema này trước khi thực thi
zh_hans: 执行前切换到此 Schema
zh_hant: 執行前切換到此綱要

source: Current %@
fr: Pourcentage actuel %@
ko: 현재 %@
tr: Geçerli %@
vi: %@ hiện tại
zh_hans: 当前%@
zh_hant: 目前的%@

source: Column order
fr: Ordre des colonnes
ko: 열 순서
tr: Sütun sırası
vi: Thứ tự cột
zh_hans: 列顺序
zh_hant: 欄位順序

source: Decrease Text Size
fr: Réduire la taille du texte
ko: 텍스트 크기 줄이기
tr: Metin Boyutunu Küçült
vi: Giảm cỡ chữ
zh_hans: 减小文字大小
zh_hant: 縮小文字大小

source: Cost
fr: Coût
ko: 비용
tr: Maliyet
vi: Chi phí
zh_hans: 成本
zh_hant: 成本

source: Copy Privileges from %@
fr: Copier les privilèges de %@
ko: %@에서 권한 복사
tr: Yetkileri %@ Kaynağından Kopyala
vi: Sao chép quyền từ %@
zh_hans: 从 %@ 复制权限
zh_hant: 從 %@ 複製權限

source: Show partitions
fr: Afficher les partitions

source: TablePro's MCP server does not provide this endpoint.
fr: Le serveur MCP de TablePro ne fournit pas cet endpoint.
ko: TablePro의 MCP 서버는 이 엔드포인트를 제공하지 않습니다.
tr: TablePro'nun MCP sunucusu bu uç noktayı sağlamıyor.
vi: Máy chủ MCP của TablePro không cung cấp endpoint này.
zh_hans: TablePro 的 MCP 服务器不提供此端点。
zh_hant: TablePro 的 MCP 伺服器不提供此端點。

source: Failed to import TLS identity into Keychain (error %d)
fr: Échec de l'importation de l'identité TLS dans le portefeuille (erreur %d)
ko: TLS ID를 키체인으로 가져오지 못했습니다 (오류 %d)
tr: TLS kimliği Keychain'e aktarılamadı (hata %d)
vi: Không thể nhập TLS identity vào Keychain (lỗi %d)
zh_hans: 将 TLS 身份导入钥匙串失败（错误 %d）
zh_hant: 將 TLS 身分匯入鑰匙圈失敗（錯誤 %d）

source: Add filter
fr: Ajouter un filtre
ko: 필터 추가
tr: Filtre ekle
vi: Thêm bộ lọc
zh_hans: 添加筛选
zh_hant: 新增篩選

source: Focus
fr: Mise au point

source: Restart to activate
fr: Redémarrer pour activer

source: Active Connections
fr: Connexions actives
ko: 활성 연결
tr: Aktif Bağlantılar
vi: Kết nối đang hoạt động
zh_hans: 活跃连接
zh_hant: 使用中的連線

source: and
fr: et
ko: 그리고
tr: ve
vi: và
zh_hans: 和
zh_hant: 且

source: Cannot connect to Ollama at %@. Is Ollama running?
fr: Impossible de se connecter à Ollama à %@. Ollama fonctionne-t-il ?
ko: %@에서 Ollama에 연결할 수 없습니다. Ollama가 실행 중입니까?
tr: %@ adresindeki Ollama'ya bağlanılamıyor. Ollama çalışıyor mu?
vi: Không thể kết nối đến Ollama tại %@. Ollama có đang chạy không?
zh_hans: 无法连接到 %@ 上的 Ollama。Ollama 是否正在运行？
zh_hant: 無法連線到 %@ 上的 Ollama。Ollama 是否正在執行？

source: Slow queries the server recorded
fr: Des requêtes lentes enregistrées par le serveur
ko: 서버가 기록한 느린 쿼리
tr: Sunucunun kaydettiği yavaş sorgular
vi: Các truy vấn chậm mà máy chủ đã ghi lại
zh_hans: 服务器记录的慢查询
zh_hant: 伺服器記錄的慢查詢
